comparedDBs/performance_test_scripts/Rocksdb_scripts/10B_RocksDB_YCSB_performance/RocksDB_10B_val128_mem8MB_zipf1.2_YCSBC.log
Set seed to 1732805856822519 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     128 bytes each (0 bytes after compression)
Entries:    1000000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    137329.1 MB (estimated)
FileSize:   15258.8 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
DB path: [/mnt/hotdb_test/rocks10B/ycsba_mem8MB_1.2_ierator_1]
ycsba        :      13.622 micros/op 73408 ops/sec 136.224 seconds 9999999 operations;   10.1 MB/s
Microseconds per read:
Count: 9999999 Average: 13.6224  StdDev: 298.10
Min: 1  Median: 2.0988  Max: 87224
Percentiles: P50: 2.10 P75: 2.85 P99: 241.59 P99.9: 1143.89 P99.99: 16888.89
------------------------------------------------------
[       0,       1 ]    21896   0.219%   0.219% 
(       1,       2 ]  4649455  46.495%  46.714% #########
(       2,       3 ]  3326298  33.263%  79.976% #######
(       3,       4 ]   496591   4.966%  84.942% #
(       4,       6 ]   416778   4.168%  89.110% #
(       6,      10 ]   789179   7.892%  97.002% ##
(      10,      15 ]    94812   0.948%  97.950% 
(      15,      22 ]    20676   0.207%  98.157% 
(      22,      34 ]     8049   0.080%  98.237% 
(      34,      51 ]     3887   0.039%  98.276% 
(      51,      76 ]     2119   0.021%  98.297% 
(      76,     110 ]     6952   0.070%  98.367% 
(     110,     170 ]    23108   0.231%  98.598% 
(     170,     250 ]    44924   0.449%  99.047% 
(     250,     380 ]    40889   0.409%  99.456% 
(     380,     580 ]    21795   0.218%  99.674% 
(     580,     870 ]    18098   0.181%  99.855% 
(     870,    1300 ]     7054   0.071%  99.926% 
(    1300,    1900 ]     2968   0.030%  99.955% 
(    1900,    2900 ]     1483   0.015%  99.970% 
(    2900,    4400 ]      645   0.006%  99.977% 
(    4400,    6600 ]      387   0.004%  99.980% 
(    6600,    9900 ]      238   0.002%  99.983% 
(    9900,   14000 ]      328   0.003%  99.986% 
(   14000,   22000 ]     1080   0.011%  99.997% 
(   22000,   33000 ]      163   0.002%  99.999% 
(   33000,   50000 ]      110   0.001% 100.000% 
(   50000,   75000 ]       34   0.000% 100.000% 
(   75000,  110000 ]        3   0.000% 100.000% 



** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0    4.69 MB   0.8      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0      3.0      0.20              0.00         1    0.198       0      0       0.0       0.0
  L1    259/0   255.96 MB   1.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
  L2   2565/0    2.50 GB   1.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
  L3   3988/0    3.84 GB   0.2      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
 Sum   6815/0    6.59 GB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   1.0      0.0      3.0      0.20              0.00         1    0.198       0      0       0.0       0.0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
User      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      3.0      0.20              0.00         1    0.198       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 138.0 total, 136.2 interval
Flush(GB): cumulative 0.001, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.2 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Estimated pending compaction bytes: 0
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 0, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 0, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 0, total-stops: 0
Block cache LRUCache@0x5fc4c39ec320#2912289 capacity: 8.00 MB seed: 1301251319 usage: 0.09 KB table_size: 256 occupancy: 1 collections: 1 last_copies: 0 last_secs: 6.7e-05 secs_since: 136
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 138.0 total, 136.2 interval
Cumulative writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 GB, 0.00 MB/s
Cumulative WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 MB, 0.00 MB/s
Interval WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0