comparedDBs/performance_test_scripts/Rocksdb_scripts/10B_RocksDB_YCSB_performance/RocksDB_10B_val128_mem8MB_zipf1.2_iterator1.log
Set seed to 1732119916232678 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     128 bytes each (0 bytes after compression)
Entries:    1000000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    137329.1 MB (estimated)
FileSize:   15258.8 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [/mnt/hotdb_test/rocks10B/ycsba_mem8MB_1.2_ierator_1]
fillzipf     :      24.333 micros/op 41095 ops/sec 24333.473 seconds 1000000000 operations;    5.6 MB/s
Microseconds per write:
Count: 1000000000 Average: 24.3335  StdDev: 2054.42
Min: 2  Median: 3.9312  Max: 3297353
Percentiles: P50: 3.93 P75: 5.55 P99: 14.75 P99.9: 3338.15 P99.99: 18396.64
------------------------------------------------------
(       1,       2 ]   340862   0.034%   0.034% 
(       2,       3 ] 217294782  21.729%  21.764% ####
(       3,       4 ] 303237136  30.324%  52.087% ######
(       4,       6 ] 295225921  29.523%  81.610% ######
(       6,      10 ] 138439696  13.844%  95.454% ###
(      10,      15 ] 37338690   3.734%  99.188% #
(      15,      22 ]  4167268   0.417%  99.604% 
(      22,      34 ]   941230   0.094%  99.699% 
(      34,      51 ]   234882   0.023%  99.722% 
(      51,      76 ]    42637   0.004%  99.726% 
(      76,     110 ]    24828   0.002%  99.729% 
(     110,     170 ]    45691   0.005%  99.733% 
(     170,     250 ]    69535   0.007%  99.740% 
(     250,     380 ]    82012   0.008%  99.749% 
(     380,     580 ]    88042   0.009%  99.757% 
(     580,     870 ]    86675   0.009%  99.766% 
(     870,    1300 ]   138637   0.014%  99.780% 
(    1300,    1900 ]   102153   0.010%  99.790% 
(    1900,    2900 ]   861596   0.086%  99.876% 
(    2900,    4400 ]   813856   0.081%  99.958% 
(    4400,    6600 ]   226458   0.023%  99.980% 
(    6600,    9900 ]    54658   0.005%  99.986% 
(    9900,   14000 ]    25463   0.003%  99.988% 
(   14000,   22000 ]    31464   0.003%  99.991% 
(   22000,   33000 ]    22330   0.002%  99.994% 
(   33000,   50000 ]    12450   0.001%  99.995% 
(   50000,   75000 ]    20655   0.002%  99.997% 
(   75000,  110000 ]     6831   0.001%  99.998% 
(  110000,  170000 ]     5087   0.001%  99.998% 
(  170000,  250000 ]     4435   0.000%  99.999% 
(  250000,  380000 ]     4532   0.000%  99.999% 
(  380000,  570000 ]     6433   0.001% 100.000% 
(  570000,  860000 ]     2655   0.000% 100.000% 
(  860000, 1200000 ]      298   0.000% 100.000% 
( 1200000, 1900000 ]      106   0.000% 100.000% 
( 1900000, 2900000 ]       13   0.000% 100.000% 
( 2900000, 4300000 ]        3   0.000% 100.000% 



** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      2/0    7.39 MB   0.5    563.0     0.0    563.0     580.8     17.8       0.0  13.5     34.1     35.2  16891.72           4140.53    212107    0.080   4114M   183M       0.0       0.0
  L1    273/1   268.41 MB   1.0    193.7    17.8    175.9     191.6     15.7       0.0  10.8     25.5     25.2   7787.70           1740.59       773   10.075   1406M    14M       0.0       0.0
  L2   2589/4    2.50 GB   1.0     64.5    14.9     49.6      55.4      5.8       0.5   3.7     21.3     18.3   3101.36            615.72     15835    0.196    474M    67M       0.0       0.0
  L3   3920/0    3.77 GB   0.2      0.0     0.0      0.0       0.0      0.0       3.8   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
 Sum   6784/5    6.54 GB   0.0    821.2    32.7    788.5     827.7     39.3       4.3  19.2     30.3     30.5  27780.78           6496.84    228715    0.121   5995M   265M       0.0       0.0
 Int      0/0    0.00 KB   0.0     10.1     0.4      9.7      10.2      0.5       0.1  20.3     26.6     26.8    389.36             79.81      2695    0.144     73M  3284K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0    821.2    32.7    788.5     784.7     -3.8       0.0   0.0     46.8     44.7  17982.58           5835.59     54541    0.330   5995M   265M       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      43.0     43.0       0.0   0.0      0.0      4.5   9798.20            661.25    174174    0.056       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 24334.5 total, 330.4 interval
Flush(GB): cumulative 43.048, interval 0.502
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 827.75 GB write, 34.83 MB/s write, 821.21 GB read, 34.56 MB/s read, 27780.8 seconds
Interval compaction: 10.18 GB write, 31.55 MB/s write, 10.13 GB read, 31.39 MB/s read, 389.4 seconds
Estimated pending compaction bytes: 173075952
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 2082, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 2101, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 136442, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 2101, total-stops: 136442
interval: 1905 total count
Block cache LRUCache@0x5cb0ec42b020#1781937 capacity: 8.00 MB seed: 407945190 usage: 20.50 KB table_size: 256 occupancy: 6 collections: 41 last_copies: 0 last_secs: 6.6e-05 secs_since: 330
Block cache entry stats(count,size,portion): Misc(6,19.98 KB,0.24395%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 24334.5 total, 0.0 interval
Cumulative writes: 1000M writes, 1000M keys, 1000M commit groups, 1.0 writes per commit group, ingest: 149.01 GB, 6.27 MB/s
Cumulative WAL: 1000M writes, 0 syncs, 1000000000.00 writes per sync, written: 149.01 GB, 6.27 MB/s
Cumulative stall: 04:20:59.937 H:M:S, 64.4 percent
Interval writes: 1 writes, 1 keys, 1 commit groups, 1.0 writes per commit group, ingest: 0.00 MB, 0.10 MB/s
Interval WAL: 1 writes, 0 syncs, 1.00 writes per sync, written: 0.00 GB, 0.10 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0